Revit 2018 API
FabricationPart.IsStraightSegment Method
 Validates if the part is a straight.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public bool IsStraightSegment(
	Document document,
	ElementId partId
)
Visual Basic
Public Function IsStraightSegment ( _
	document As Document, _
	partId As ElementId _
) As Boolean
Visual C++
public:
bool IsStraightSegment(
	Document^ document,
	ElementId^ partId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
partId
Type: Autodesk.Revit.DB.ElementId
 Id of the straight.
Return Value
 Returns true if the part is a straight false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace